'''
Постройте граф, моделирующий дорожную сеть, на основе данных фрагмента карты (например, 2ГИС или Яндекс.Карты) любой
местности по Вашему выбору с числом вершин не менее 15.
Постройте с пользователем диалог таким образом, чтобы он мог запрашивать у программы информацию о кратчайшем расстоянии
между двумя пунктами карты (вершинами графа), при этом получал на экране информацию о кратчайшем расстоянии и путь.
Граф должен быть задан в табличной форме в виде матрицы смежности в файле. Внутренний формат файла можно выбрать по
Вашему усмотрению (простой текстовый файл с разделителями-пробелами, файл формата csv, файл формата MS Excel и пр.).
'''

import openpyexcel

